{"keras_version": "2.1.3", "config": [{"config": {"batch_input_shape": [null, 30, 37], "bias_regularizer": null, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "implementation": 1, "activation": "tanh", "kernel_regularizer": null, "trainable": true, "stateful": false, "dropout": 0.2, "unroll": false, "return_sequences": false, "dtype": "float32", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "use_bias": true, "name": "lstm_6", "recurrent_regularizer": null, "bias_constraint": null, "units": 75, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "n": 10, "name": "repeat_vector_3"}, "class_name": "RepeatVector"}, {"config": {"implementation": 1, "bias_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "unroll": false, "trainable": true, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "units": 50, "name": "lstm_7", "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "layer": {"config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_3", "activation": "softmax", "bias_constraint": null, "trainable": true, "units": 11, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, "name": "time_distributed_3"}, "class_name": "TimeDistributed"}], "class_name": "Sequential", "backend": "tensorflow"}