{"backend": "tensorflow", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 30], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"sparse": false, "batch_input_shape": [null, 10], "dtype": "float32", "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"embeddings_constraint": null, "name": "embedding_1", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 64, "batch_input_shape": [null, 30], "trainable": true, "mask_zero": true, "dtype": "float32", "activity_regularizer": null, "input_dim": 37, "input_length": 30}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"embeddings_constraint": null, "name": "embedding_2", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 64, "batch_input_shape": [null, 10], "trainable": true, "mask_zero": true, "dtype": "float32", "activity_regularizer": null, "input_dim": 11, "input_length": 10}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2", "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "dropout": 0.0, "implementation": 1, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "return_sequences": false, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "return_state": false, "activity_regularizer": null, "stateful": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "units": 64, "unroll": false, "use_bias": true, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "dropout": 0.0, "implementation": 1, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "return_sequences": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "recurrent_regularizer": null, "name": "lstm_2", "recurrent_dropout": 0.0, "return_state": false, "activity_regularizer": null, "stateful": false, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "units": 64, "unroll": false, "use_bias": true, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}], ["lstm_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]], "name": "lstm_2", "class_name": "LSTM"}, {"config": {"trainable": true, "name": "time_distributed_1", "layer": {"config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 11, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}}, "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "name": "time_distributed_1", "class_name": "TimeDistributed"}], "output_layers": [["time_distributed_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.3"}