{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"units": 75, "stateful": false, "batch_input_shape": [null, 30, 37], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "unit_forget_bias": true, "bias_regularizer": null, "dtype": "float32", "go_backwards": false, "kernel_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": false, "implementation": 1, "dropout": 0.0, "activation": "tanh", "unroll": false, "name": "lstm_4"}}, {"class_name": "RepeatVector", "config": {"n": 10, "trainable": true, "name": "repeat_vector_2"}}, {"class_name": "LSTM", "config": {"units": 50, "stateful": false, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "unit_forget_bias": true, "bias_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "kernel_regularizer": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": true, "implementation": 1, "dropout": 0.0, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "lstm_5"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"units": 11, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true}}, "trainable": true, "name": "time_distributed_1"}}]}