{"config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 30, 37], "name": "input_24", "sparse": false}, "class_name": "InputLayer", "name": "input_24"}, {"inbound_nodes": [[["input_24", 0, 0, {}]]], "config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dropout": 0.5, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "bias_constraint": null, "units": 75, "stateful": false, "unit_forget_bias": true, "implementation": 1, "name": "lstm_35", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh"}, "class_name": "LSTM", "name": "lstm_35"}, {"inbound_nodes": [[["lstm_35", 0, 0, {}]]], "config": {"dims": [2, 1], "trainable": true, "name": "permute_48"}, "class_name": "Permute", "name": "permute_48"}, {"inbound_nodes": [[["permute_48", 0, 0, {}]]], "config": {"units": 30, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_38", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null}, "class_name": "Dense", "name": "dense_38"}, {"inbound_nodes": [[["dense_38", 0, 0, {}]]], "config": {"dims": [2, 1], "trainable": true, "name": "permute_49"}, "class_name": "Permute", "name": "permute_49"}, {"inbound_nodes": [[["lstm_35", 0, 0, {}], ["permute_49", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_20"}, "class_name": "Multiply", "name": "multiply_20"}, {"inbound_nodes": [[["multiply_20", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_5"}, "class_name": "Flatten", "name": "flatten_5"}, {"inbound_nodes": [[["flatten_5", 0, 0, {}]]], "config": {"n": 10, "trainable": true, "name": "repeat_vector_17"}, "class_name": "RepeatVector", "name": "repeat_vector_17"}, {"inbound_nodes": [[["repeat_vector_17", 0, 0, {}]]], "config": {"recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dropout": 0.5, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "bias_constraint": null, "units": 50, "stateful": false, "unit_forget_bias": true, "implementation": 1, "name": "lstm_36", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "activity_regularizer": null, "activation": "tanh"}, "class_name": "LSTM", "name": "lstm_36"}, {"inbound_nodes": [[["lstm_36", 0, 0, {}]]], "config": {"trainable": true, "layer": {"config": {"units": 11, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_39", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_15"}, "class_name": "TimeDistributed", "name": "time_distributed_15"}], "input_layers": [["input_24", 0, 0]], "output_layers": [["time_distributed_15", 0, 0]], "name": "model_15"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.3"}