{"config": [{"config": {"name": "bidirectional_15", "dtype": "float32", "layer": {"config": {"return_sequences": true, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_dropout": 0.0, "unit_forget_bias": true, "unroll": false, "dropout": 0.3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "trainable": true, "bias_constraint": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_17", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 75}, "class_name": "LSTM"}, "merge_mode": "concat", "batch_input_shape": [null, 30, 37], "trainable": true}, "class_name": "Bidirectional"}, {"config": {"name": "bidirectional_16", "dtype": "float32", "layer": {"config": {"return_sequences": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_dropout": 0.0, "unit_forget_bias": true, "unroll": false, "dropout": 0.3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "trainable": true, "bias_constraint": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_18", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 50}, "class_name": "LSTM"}, "merge_mode": "concat", "batch_input_shape": [null, 30, 37], "trainable": true}, "class_name": "Bidirectional"}, {"config": {"name": "repeat_vector_9", "trainable": true, "n": 10}, "class_name": "RepeatVector"}, {"config": {"layer": {"config": {"return_sequences": true, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_dropout": 0.0, "unit_forget_bias": true, "unroll": false, "dropout": 0.3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "trainable": true, "bias_constraint": null, "recurrent_constraint": null, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "name": "lstm_19", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "units": 50}, "class_name": "LSTM"}, "name": "bidirectional_17", "merge_mode": "concat", "trainable": true}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_13", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 500}, "class_name": "Dense"}, "name": "time_distributed_10", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_14", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 11}, "class_name": "Dense"}], "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential"}