{"keras_version": "2.1.3", "config": {"output_layers": [["time_distributed_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 10], "dtype": "float32", "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"sparse": false, "batch_input_shape": [null, 30], "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"embeddings_constraint": null, "input_dim": 11, "input_length": 10, "activity_regularizer": null, "batch_input_shape": [null, 10], "embeddings_regularizer": null, "output_dim": 64, "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": true, "dtype": "float32", "name": "embedding_2"}, "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2"}, {"config": {"embeddings_constraint": null, "input_dim": 37, "input_length": 30, "activity_regularizer": null, "batch_input_shape": [null, 30], "embeddings_regularizer": null, "output_dim": 64, "trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": true, "dtype": "float32", "name": "embedding_1"}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1"}, {"config": {"dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "lstm_2", "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "implementation": 1, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "unroll": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "lstm_2"}, {"config": {"dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "activation": "tanh", "return_sequences": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "lstm_1", "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "implementation": 1, "unit_forget_bias": true, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "unroll": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true}, "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "lstm_1"}, {"config": {"normalize": false, "trainable": true, "axes": [2, 2], "name": "dot_1"}, "class_name": "Dot", "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_1", 0, 0, {}]]], "name": "dot_1"}, {"config": {"trainable": true, "activation": "softmax", "name": "attention"}, "class_name": "Activation", "inbound_nodes": [[["dot_1", 0, 0, {}]]], "name": "attention"}, {"config": {"normalize": false, "trainable": true, "axes": [2, 1], "name": "dot_2"}, "class_name": "Dot", "inbound_nodes": [[["attention", 0, 0, {}], ["lstm_1", 0, 0, {}]]], "name": "dot_2"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["dot_2", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "name": "concatenate_1"}, {"config": {"trainable": true, "name": "time_distributed_1", "layer": {"config": {"activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 64, "trainable": true, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"config": {"trainable": true, "name": "time_distributed_2", "layer": {"config": {"activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 11, "trainable": true, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2"}]}, "class_name": "Model", "backend": "tensorflow"}