{"keras_version": "2.1.3", "backend": "tensorflow", "config": {"name": "model_1", "output_layers": [["time_distributed_2", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"name": "input_2", "config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 10]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 30]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "embedding_2", "config": {"batch_input_shape": [null, 10], "embeddings_regularizer": null, "output_dim": 64, "dtype": "float32", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "name": "embedding_2", "activity_regularizer": null, "input_length": 10, "input_dim": 11, "embeddings_constraint": null, "trainable": true, "mask_zero": true}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "embedding_1", "config": {"batch_input_shape": [null, 30], "embeddings_regularizer": null, "output_dim": 64, "dtype": "float32", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "name": "embedding_1", "activity_regularizer": null, "input_length": 30, "input_dim": 37, "embeddings_constraint": null, "trainable": true, "mask_zero": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "lstm_2", "config": {"activation": "tanh", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": true, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_2", "activity_regularizer": null, "return_state": false, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 64, "implementation": 1, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_dropout": 0.0}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "lstm_1", "config": {"activation": "tanh", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unroll": true, "dropout": 0.0, "bias_regularizer": null, "name": "lstm_1", "activity_regularizer": null, "return_state": false, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 64, "implementation": 1, "go_backwards": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "recurrent_dropout": 0.0}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dot_1", "config": {"name": "dot_1", "axes": [2, 2], "trainable": true, "normalize": false}, "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_1", 0, 0, {}]]], "class_name": "Dot"}, {"name": "attention", "config": {"name": "attention", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "dot_2", "config": {"name": "dot_2", "axes": [2, 1], "trainable": true, "normalize": false}, "inbound_nodes": [[["attention", 0, 0, {}], ["lstm_1", 0, 0, {}]]], "class_name": "Dot"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["dot_2", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "time_distributed_1", "config": {"name": "time_distributed_1", "layer": {"config": {"activation": "tanh", "bias_constraint": null, "kernel_constraint": null, "units": 64, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"name": "time_distributed_2", "config": {"name": "time_distributed_2", "layer": {"config": {"activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "units": 11, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, "trainable": true}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "class_name": "TimeDistributed"}]}, "class_name": "Model"}